{
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "bos_token_id": null,
  "dim": 768,
  "dropout": 0.1,
  "dtype": "float32",
  "eos_token_id": null,
  "hidden_dim": 3072,
  "id2label": {
    "0": "Administrative / Service Delays",
    "1": "Animal-Related Issues",
    "2": "Electrical & Power Infrastructure",
    "3": "Noise & Environmental Issues",
    "4": "Public Safety & Emergency",
    "5": "Roads & Transportation Infrastructure",
    "6": "Sanitation & Public Health",
    "7": "Traffic & Civic Discipline",
    "8": "Urban Facilities & Amenities",
    "9": "Water Supply & Drainage"
  },
  "initializer_range": 0.02,
  "label2id": {
    "Administrative / Service Delays": 0,
    "Animal-Related Issues": 1,
    "Electrical & Power Infrastructure": 2,
    "Noise & Environmental Issues": 3,
    "Public Safety & Emergency": 4,
    "Roads & Transportation Infrastructure": 5,
    "Sanitation & Public Health": 6,
    "Traffic & Civic Discipline": 7,
    "Urban Facilities & Amenities": 8,
    "Water Supply & Drainage": 9
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "tie_word_embeddings": true,
  "transformers_version": "5.1.0",
  "use_cache": false,
  "vocab_size": 30522
}
